# What is a DataFrame?
### A DataFrame is a 2D labeled data structure with columns that can be of different types. Think of it as:

* A spreadsheet or SQL table
* A dictionary of Series objects
* The most important data structure in Pandas!

## üèóÔ∏è Creating DataFrames

### 1- From Dictionary

In [2]:
import pandas as pd
import numpy as np

# Method 1: Dictionary of lists
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 35, 28],
    'City': ['New York', 'Paris', 'London', 'Tokyo'],
    'Salary': [70000, 80000, 75000, 85000]
}
df = pd.DataFrame(data)
df

      Name  Age      City  Salary
0    Alice   25  New York   70000
1      Bob   30     Paris   80000
2  Charlie   35    London   75000
3    David   28     Tokyo   85000

### 2- Dictionary of Series

In [8]:
df = pd.DataFrame({
    'A': pd.Series([1, 2, 3]),
    'B': pd.Series([4, 5, 6]),
    'C': pd.Series([7, 8, 9])
})
df

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

### 3- From List of Dictionaries

In [11]:
data = [
    {'Name': 'Alice', 'Age': 25, 'City': 'New York'},
    {'Name': 'Bob', 'Age': 30, 'City': 'Paris'},
    {'Name': 'Charlie', 'Age': 35}  # Missing 'City'
]
df = pd.DataFrame(data)
# Missing values become NaN
df

      Name  Age      City
0    Alice   25  New York
1      Bob   30     Paris
2  Charlie   35       NaN

### 4 - From List of Lists

In [15]:
data = [
    ['Alice', 25, 'New York'],
    ['Bob', 30, 'Paris'],
    ['Charlie', 35, 'London']
]
df = pd.DataFrame(data, columns=['Name', 'Age', 'City' ])
df

      Name  Age      City
0    Alice   25  New York
1      Bob   30     Paris
2  Charlie   35    London

### 5- From NumPy Array

In [17]:
data = np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]])
df = pd.DataFrame(data, 
                  columns=['A', 'B', 'C'],
                  index=['row1', 'row2', 'row3'])
df

      A  B  C
row1  1  2  3
row2  4  5  6
row3  7  8  9

### 6 - From CSV File

In [3]:
df = pd.read_csv('data.csv')
df

    Name  Age  Score
0    Ali   22     85
1   Sara   25     90
2   John   23     78
3   Mona   24     92
4  David   26     88

## üîç Exploring DataFrames

In [12]:
df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Age': [25, 30, 35, 28, 32],
    'Department': ['IT', 'HR', 'IT', 'Finance', 'HR'],
    'Salary': [70000, 60000, 75000, 85000, 65000]
})

# View first/last rows
# print(df.head())        # First 5 rows
# print(df.head(3))       # First 3 rows
# print(df.tail())        # Last 5 rows

# Shape and size
# print(df.shape)         # (5, 4) - 5 rows, 4 columns
# print(df.size)          # 20 - total elements
# print(len(df))          # 5 - number of rows

# Column and index info
# print(df.columns)       # Column names
# print(df.index)         # Row indices
# print(df.dtypes)        # Data types

# # Detailed information
# print(df.info())

# # Statistical summary
# print(df.describe())               # Numeric columns only
print(df.describe(include='all'))  # All columns

         Name        Age Department        Salary
count       5   5.000000          5      5.000000
unique      5        NaN          3           NaN
top     Alice        NaN         IT           NaN
freq        1        NaN          2           NaN
mean      NaN  30.000000        NaN  71000.000000
std       NaN   3.807887        NaN   9617.692031
min       NaN  25.000000        NaN  60000.000000
25%       NaN  28.000000        NaN  65000.000000
50%       NaN  30.000000        NaN  70000.000000
75%       NaN  32.000000        NaN  75000.000000
max       NaN  35.000000        NaN  85000.000000

## üìä Selecting Data

In [15]:
# Single column (returns Series)
print(df['Name'])
print(df.Name)  # Dot notation (only for valid identifiers)

# Multiple columns (returns DataFrame)
print(df[['Name', 'Age']])

# All columns except some
print(df.drop(columns=['Salary']))  # Doesn't modify original
print(df.drop(columns=['Salary', 'Department']))

0      Alice
1        Bob
2    Charlie
3      David
4        Eve
Name: Name, dtype: object
0      Alice
1        Bob
2    Charlie
3      David
4        Eve
Name: Name, dtype: object
      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
3    David   28
4      Eve   32
      Name  Age Department
0    Alice   25         IT
1      Bob   30         HR
2  Charlie   35         IT
3    David   28    Finance
4      Eve   32         HR
      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
3    David   28
4      Eve   32

### Selecting Rows

In [ ]:
# By position (.iloc)
print(df.iloc[0])          # First row (Series)
print(df.iloc[0:3])        # First 3 rows (DataFrame)
print(df.iloc[[0, 2, 4]])  # Specific rows
print(df.iloc[-1])         # Last row

# By label (.loc)
print(df.loc[0])           # Row with index 0
print(df.loc[0:2])         # Rows 0 to 2 (INCLUSIVE!)
print(df.loc[[0, 2, 4]])   # Specific rows

# Boolean indexing
print(df[df['Age'] > 28])
print(df[df['Department'] == 'IT'])
print(df[(df['Age'] > 28) & (df['Salary'] > 70000)])

## Selecting Both Rows and Columns

In [ ]:
# .loc[rows, columns]
print(df.loc[0:2, 'Name'])              # Rows 0-2, column 'Name'
print(df.loc[0:2, ['Name', 'Age']])     # Rows 0-2, multiple columns
print(df.loc[:, 'Name':'Department'])   # All rows, columns range

# .iloc[rows, columns]
print(df.iloc[0:3, 0])                  # First 3 rows, first column
print(df.iloc[0:3, [0, 2]])             # First 3 rows, columns 0 and 2
print(df.iloc[:, 0:2])                  # All rows, first 2 columns

# Boolean + columns
print(df.loc[df['Age'] > 28, ['Name', 'Salary']])

In [18]:
df = pd.read_csv('employees.csv')
df

    Name  Age  Salary Department
0    Ali   22    3000         HR
1   Sara   29    5200         IT
2   John   31    6100    Finance
3   Mona   26    4500         IT
4  David   35    7200         HR
5   Lina   24    3800  Marketing
6   Omar   40    8000         IT
7   Nora   28    5000    Finance

In [22]:
# Select rows 1‚Äì5 and columns from Age ‚Üí Salary
df.loc[1:5 , 'Age':'Salary']

   Age  Salary
1   29    5200
2   31    6100
3   26    4500
4   35    7200
5   24    3800

In [26]:
# Age > 30 , Show only Name and Salary
df.loc[df['Age'] > 30 , ['Name','Salary'] ]

    Name  Salary
2   John    6100
4  David    7200
6   Omar    8000

In [27]:
df['Aya'] = 'Hi'
df

    Name  Age  Salary Department Aya
0    Ali   22    3000         HR  Hi
1   Sara   29    5200         IT  Hi
2   John   31    6100    Finance  Hi
3   Mona   26    4500         IT  Hi
4  David   35    7200         HR  Hi
5   Lina   24    3800  Marketing  Hi
6   Omar   40    8000         IT  Hi
7   Nora   28    5000    Finance  Hi

In [29]:
df['Age+Salary'] = df['Age']+df['Salary']
df

    Name  Age  Salary Department Aya  Age+Salary
0    Ali   22    3000         HR  Hi        3022
1   Sara   29    5200         IT  Hi        5229
2   John   31    6100    Finance  Hi        6131
3   Mona   26    4500         IT  Hi        4526
4  David   35    7200         HR  Hi        7235
5   Lina   24    3800  Marketing  Hi        3824
6   Omar   40    8000         IT  Hi        8040
7   Nora   28    5000    Finance  Hi        5028

In [30]:
df['Senior'] = df['Age'] > 30
df

    Name  Age  Salary Department Aya  Age+Salary  Senior
0    Ali   22    3000         HR  Hi        3022   False
1   Sara   29    5200         IT  Hi        5229   False
2   John   31    6100    Finance  Hi        6131    True
3   Mona   26    4500         IT  Hi        4526   False
4  David   35    7200         HR  Hi        7235    True
5   Lina   24    3800  Marketing  Hi        3824   False
6   Omar   40    8000         IT  Hi        8040    True
7   Nora   28    5000    Finance  Hi        5028   False

In [48]:
df.loc[4 , 'Salary'] = 50
df

    Name  Age  Salary Department Aya  Age+Salary  Senior
0    Ali   22  3000.0         HR  Hi        3022   False
1   Sara   29  5200.0         IT  Hi        5229   False
2   John   31  6206.1    Finance  Hi        6131    True
3   Mona   26  4500.0         IT  Hi        4526   False
4  David   35    50.0         HR  Hi        7235    True
5   Lina   24  3800.0  Marketing  Hi        3824   False
6   Omar   40  8108.0         IT  Hi        8040    True
7   Nora   28  5000.0    Finance  Hi        5028   False

In [49]:
df.loc[df['Age'] > 30 , 'Salary'] += 50
df

    Name  Age  Salary Department Aya  Age+Salary  Senior
0    Ali   22  3000.0         HR  Hi        3022   False
1   Sara   29  5200.0         IT  Hi        5229   False
2   John   31  6256.1    Finance  Hi        6131    True
3   Mona   26  4500.0         IT  Hi        4526   False
4  David   35   100.0         HR  Hi        7235    True
5   Lina   24  3800.0  Marketing  Hi        3824   False
6   Omar   40  8158.0         IT  Hi        8040    True
7   Nora   28  5000.0    Finance  Hi        5028   False

In [54]:
# Create DataFrame with duplicates
df = pd.DataFrame({
    'A': [1, 2, 2, 3, 3, 3],
    'B': [10, 20, 20, 30, 30, 40],
    'C': [100, 200, 200, 300, 300, 400]
})
print(df)
# Check for duplicates
print(df.duplicated())              # Boolean Series
print(df.duplicated().sum())        # Count duplicates
df_clean = df.drop_duplicates()
df_clean

   A   B    C
0  1  10  100
1  2  20  200
2  2  20  200
3  3  30  300
4  3  30  300
5  3  40  400
0    False
1    False
2     True
3    False
4     True
5    False
dtype: bool
2

   A   B    C
0  1  10  100
1  2  20  200
3  3  30  300
5  3  40  400

In [55]:
df_clean = df.drop_duplicates(keep='first')   # Keep first occurrence
df_clean

   A   B    C
0  1  10  100
1  2  20  200
3  3  30  300
5  3  40  400

In [56]:
df_clean = df.drop_duplicates(keep='last')    # Keep last occurrence
df_clean

   A   B    C
0  1  10  100
2  2  20  200
4  3  30  300
5  3  40  400

In [57]:
df_clean = df.drop_duplicates(keep=False)     # Remove all duplicates
df_clean

   A   B    C
0  1  10  100
5  3  40  400

In [58]:
# Drop duplicates based on specific columns
df_clean = df.drop_duplicates(subset=['A'])
df_clean

   A   B    C
0  1  10  100
1  2  20  200
3  3  30  300

In [59]:
df_clean = df.drop_duplicates(subset=['A', 'B'])
df_clean

   A   B    C
0  1  10  100
1  2  20  200
3  3  30  300
5  3  40  400

In [60]:
df

   A   B    C
0  1  10  100
1  2  20  200
2  2  20  200
3  3  30  300
4  3  30  300
5  3  40  400

In [62]:
# View types
print(df.dtypes)

A    int64
B    int64
C    int64
dtype: object

In [65]:

# Convert single column
df['A'] = df['A'].astype(float)
df['B'] = df['B'].astype(str)
print(df.dtypes)

A    float64
B     object
C      int64
dtype: object

In [66]:
df

     A   B    C
0  1.0  10  100
1  2.0  20  200
2  2.0  20  200
3  3.0  30  300
4  3.0  30  300
5  3.0  40  400

In [69]:
print(df.memory_usage(deep=True))
print(df.info(memory_usage='deep'))

Index    132
A         48
B        306
C         48
dtype: int64
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       6 non-null      float64
 1   B       6 non-null      object
 2   C       6 non-null      int64
dtypes: float64(1), int64(1), object(1)
memory usage: 534.0 bytes
None

In [71]:
employees = pd.DataFrame({
    'EmployeeID': [101, 102, 103, 104, 105],
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Department': ['IT', 'HR', 'IT', 'Finance', 'HR'],
    'Salary': [70000, 60000, 75000, 85000, 65000],
    'Years': [3, 5, 2, 7, 4]
})
# Add calculated columns
employees['Bonus'] = employees['Salary'] * 0.1
employees['Total_Comp'] = employees['Salary'] + employees['Bonus']
employees

   EmployeeID     Name Department  Salary  Years   Bonus  Total_Comp
0         101    Alice         IT   70000      3  7000.0     77000.0
1         102      Bob         HR   60000      5  6000.0     66000.0
2         103  Charlie         IT   75000      2  7500.0     82500.0
3         104    David    Finance   85000      7  8500.0     93500.0
4         105      Eve         HR   65000      4  6500.0     71500.0

In [76]:
# Performance rating based on years
def get_rating(years):
    if years < 3:
        return 'Junior'
    elif years < 6:
        return 'Mid'
    else:
        return 'Senior'

employees['Level'] = employees['Years'].apply(get_rating)

# Department summary
print("\nDepartment-wise average salary:")
print(    employees.groupby('Department') ['Salary'].mean()    )

# Top earners
top_earners = employees.nlargest(3, 'Total_Comp')
print("\nTop 3 earners:")
print(top_earners[['Name', 'Total_Comp']])
employees

Department-wise average salary:
Department
Finance    85000.0
HR         62500.0
IT         72500.0
Name: Salary, dtype: float64

Top 3 earners:
      Name  Total_Comp
3    David     93500.0
2  Charlie     82500.0
0    Alice     77000.0

   EmployeeID     Name Department  Salary  Years   Bonus  Total_Comp   Level
0         101    Alice         IT   70000      3  7000.0     77000.0     Mid
1         102      Bob         HR   60000      5  6000.0     66000.0     Mid
2         103  Charlie         IT   75000      2  7500.0     82500.0  Junior
3         104    David    Finance   85000      7  8500.0     93500.0  Senior
4         105      Eve         HR   65000      4  6500.0     71500.0     Mid

## Exercise 1: Student Records

### Create a DataFrame with 15 students including:

##### StudentID, Name, Grade, Math_Score, English_Score, Science_Score

#### Tasks:

* Add a 'Total_Score' column
* Add an 'Average' column
* Add a 'Pass_Fail' column (Pass if average >= 60)
* Find top 5 students by average
* Count students per grade
* Calculate average score per grade

In [78]:
stu = pd.read_csv('students.csv')
stu

    StudentID   Name Grade  Math_Score  English_Score  Science_Score
0           1    Ali     A          80             78             82
1           2   Sara     B          65             70             66
2           3   John     A          90             85             88
3           4   Mona     C          55             60             58
4           5  David     B          70             68             72
5           6   Lina     A          88             90             87
6           7   Omar     C          60             62             65
7           8   Nora     B          75             73             77
8           9   Adam     A          92             88             90
9          10   Maya     B          68             65             69
10         11   Rami     C          58             55             60
11         12   Lara     A          85             82             84
12         13   Zaid     B          72             74             76
13         14   Huda     C          50             58             54
14         15  Tariq     A          95             91             93

In [80]:
stu['Total Score'] =  stu['Math_Score']+stu['English_Score']+stu['Science_Score']
stu

,StudentID,Name,Grade,Math_Score,English_Score,Science_Score,Total Score
0,1,Ali,A,80,78,82,240
1,2,Sara,B,65,70,66,201
2,3,John,A,90,85,88,263
3,4,Mona,C,55,60,58,173
4,5,David,B,70,68,72,210
5,6,Lina,A,88,90,87,265
6,7,Omar,C,60,62,65,187
7,8,Nora,B,75,73,77,225
8,9,Adam,A,92,88,90,270
9,10,Maya,B,68,65,69,202
10,11,Rami,C,58,55,60,173
11,12,Lara,A,85,82,84,251
12,13,Zaid,B,72,74,76,222
13,14,Huda,C,50,58,54,162
14,15,Tariq,A,95,91,93,279

In [83]:
stu['Average'] = stu['Total Score'] / 3
stu

,StudentID,Name,Grade,Math_Score,English_Score,Science_Score,Total Score,Average
0,1,Ali,A,80,78,82,240,80.000000
1,2,Sara,B,65,70,66,201,67.000000
2,3,John,A,90,85,88,263,87.666667
3,4,Mona,C,55,60,58,173,57.666667
4,5,David,B,70,68,72,210,70.000000
5,6,Lina,A,88,90,87,265,88.333333
6,7,Omar,C,60,62,65,187,62.333333
7,8,Nora,B,75,73,77,225,75.000000
8,9,Adam,A,92,88,90,270,90.000000
9,10,Maya,B,68,65,69,202,67.333333
10,11,Rami,C,58,55,60,173,57.666667
11,12,Lara,A,85,82,84,251,83.666667
12,13,Zaid,B,72,74,76,222,74.000000
13,14,Huda,C,50,58,54,162,54.000000
14,15,Tariq,A,95,91,93,279,93.000000

In [86]:
def passorfail(average):
    if average >= 60 :
        return "pass"
    return "fail"

stu['Pass_Fail'] = stu['Average'].apply(passorfail)
stu

,StudentID,Name,Grade,Math_Score,English_Score,Science_Score,Total Score,Average,Pass_Fail
0,1,Ali,A,80,78,82,240,80.000000,pass
1,2,Sara,B,65,70,66,201,67.000000,pass
2,3,John,A,90,85,88,263,87.666667,pass
3,4,Mona,C,55,60,58,173,57.666667,fail
4,5,David,B,70,68,72,210,70.000000,pass
5,6,Lina,A,88,90,87,265,88.333333,pass
6,7,Omar,C,60,62,65,187,62.333333,pass
7,8,Nora,B,75,73,77,225,75.000000,pass
8,9,Adam,A,92,88,90,270,90.000000,pass
9,10,Maya,B,68,65,69,202,67.333333,pass
10,11,Rami,C,58,55,60,173,57.666667,fail
11,12,Lara,A,85,82,84,251,83.666667,pass
12,13,Zaid,B,72,74,76,222,74.000000,pass
13,14,Huda,C,50,58,54,162,54.000000,fail
14,15,Tariq,A,95,91,93,279,93.000000,pass

In [88]:
top_5_students = stu.nlargest(5, 'Average')
top_5_students

,StudentID,Name,Grade,Math_Score,English_Score,Science_Score,Total Score,Average,Pass_Fail
14,15,Tariq,A,95,91,93,279,93.000000,pass
8,9,Adam,A,92,88,90,270,90.000000,pass
5,6,Lina,A,88,90,87,265,88.333333,pass
2,3,John,A,90,85,88,263,87.666667,pass
11,12,Lara,A,85,82,84,251,83.666667,pass

In [92]:
stu['Grade'].value_counts()

Grade
A    6
B    5
C    4
Name: count, dtype: int64

In [96]:
stu.groupby('Grade')['Average'].mean()

Grade
A    87.111111
B    70.666667
C    57.916667
Name: Average, dtype: float64

In [98]:
stu.groupby('Grade')[['Math_Score','English_Score','Science_Score']].mean()

       Math_Score  English_Score  Science_Score
Grade
A       88.333333      85.666667      87.333333
B       70.000000      70.000000      72.000000
C       55.750000      58.750000      59.250000